package com.example.app;

public class MapStr {
	//マップ構造 [分岐スタート地点][合流地点][コマの効果][...]の順 0,1列目は全て0
	//ルートの長さ [メインの長さ][分岐の長さ][分岐の長さ]の順
	//0:何もなし 1:getItem 2:goFoward 3:backFoward 4:crewRestart 5:crewTakeItem 6:crewGiveItem 7:振り出し
	int[] map1 =	{0, 0, //メインルート
					 0, 1, 2, 0, 1, 0, 0, 0, 2, 0,
					 3, 2, 0, 1, 0, 0, 0, 0, 0, 2,
					 0, 0, 3, 2, 0, 0, 3, 2, 0, 0,
					 3, 0,
					 7,17, //分岐ルート
					 0, 0, 1, 3, 0, 2, 0, 1, 0};
	
	
	int[] map2 = 	{0, 0,
					 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 
					 3, 0, 0, 1, 0, 2, 0, 0, 1, 0, 
					 3, 0, 1, 0, 0, 2, 0, 3, 1, 0,
					 2, 0, 6, 
					}
	}
}
